# NamingUtils Methods

---
The NamingUtils type exposes the following members.
| Name| Description
---|---|---
| CompareNames|  Compares two object name strings using Revit's comparison rules.
| IsValidName|  Identifies if the input string is valid for use as an object name in Revit.
Top
#### Reference
NamingUtils Class
Autodesk.Revit.DB Namespace